controllers/BugsController.php

    public function actionIndex()
    {
        $dataProvider = new ActiveDataProvider([
            'query' => Bugs::find(),
        ]);

        $model = array();
        $data = Bugs::find()->all();
---
SELECT * FROM `Bugs`