controllers/KomplainController.php

SELECT * FROM `complain`
---
    public function actionIndex()
    {
        $dataProvider = new ActiveDataProvider([
            'query' => Complain::find(),
        ]);

        if (Yii::$app->user->isGuest) {
            $this->redirect(Yii::$app->urlManager->createAbsoluteUrl('site/login'));
        }
        $model = array();
        $data = Complain::find()->all();