controllers/SiteController.php

INSERT INTO `complain` (`jumlahKomplain`, `tanggal`, `responKomplain`, `jumlahCS`) VALUES (156, '3/1/2014', 100, 10)
---
    public function actionUpload()
    {
        $model = new UploadForm();
        $listIsi = array();
        array_push($listIsi, "masuk -2");
        if (Yii::$app->request->isPost) {
            $model->file = UploadedFile::getInstance($model, 'file');
            array_push($listIsi, "masuk -1");
           if ($model->file && $model->validate()) {
                $model->file->saveAs('uploads/' . $model->file->baseName . '.' . $model->file->extension);
            }
            array_push($listIsi, $model->file->tempName);
            $tpm = tempnam("C:\xampp\htdocs\yiibi\web\uploads\complain.csv", "complain");
            array_push($listIsi, $tpm);
            if (($fp = fopen("C:\xampp\htdocs\yiibi\web\uploads\complain.csv", "r")) !== false) {
                array_push($listIsi, "masuk 1");
			     while (($line = fgetcsv($fp, 1000, ",")) !== false) {
                    array_push($listIsi, "masuk 2");
                    array_push($listIsi, $line[0], $line[1], $line[2], $line[3]);
                    $new = new Complain;
                    $new->jumlahKomplain = $line[0];
                    $new->tanggal = $line[1];
                    $new->responKomplain = $line[2];
                    $new->jumlahCS = $line[3];
                    $new->save();