controllers/SiteController.php

    public function actionIndex() {
        if (Yii::$app->user->isGuest) {
            $this->redirect(Yii::$app->urlManager->createAbsoluteUrl('site/login'));
        }
        $model = array();
        $data = Complain::find()->all();
---
SELECT * FROM `complain`

      public function actionUpload()
    {

        $model = new UploadForm();
        if (Yii::$app->request->isPost) {
            $model->file = UploadedFile::getInstance($model, 'file');
            $tipe = Yii::$app->request->post('tipe_laporan');
            if ($tipe == "komplain") {
                Complain::deleteAll();
                if ($model->file && $model->validate()) {
                   if($fp = fopen($model->file->tempName, 'r')){
                        while (($line = fgetcsv($fp, 1000, ",")) !== false) {
                            $new = new Complain;
                            $new->jumlahKomplain = $line[0];
                            $new->tanggal = $line[1];
                            $new->responKomplain = $line[2];
                            $new->jumlahCS = $line[3];
                            $new->save();
---
DELETE FROM `complain`
INSERT INTO `complain` (`jumlahKomplain`, `tanggal`, `responKomplain`, `jumlahCS`) VALUES (50, '2014-01-01', 48, 10)

                            $new->jumlahBugs = $line[0];
                            $new->tanggal = $line[1];
                            $new->tipeBugs = $line[2];
                            $new->save();
---
INSERT INTO `Bugs` (`jumlahBugs`, `tanggal`, `tipeBugs`) VALUES (5, '2014-01-01', 'Fitur Pencarian Tiket Promo')