components/Util.php

    public function countUser() {
        return User::find()->count();
---
SELECT COUNT(*) FROM `user`